In [9]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn import metrics

In [10]:
data = pd.read_csv('Social Media Ad Data.csv')

In [11]:
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

Converting the data from column into binary instead of text

In [12]:
data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [13]:
data['Gender'] = data['Gender'].map({'Male':1 , 'Female':0})

In [14]:
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510       1   19            19000          0
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0
3  15603246       0   27            57000          0
4  15804002       1   19            76000          0

Dropping the column with user ID. User ID will not play any role in deciding the Purchase outcome

In [16]:
data = data.drop(['User ID'], axis = 1)

In [17]:
data.head()

   Gender  Age  EstimatedSalary  Purchased
0       1   19            19000          0
1       1   35            20000          0
2       0   26            43000          0
3       0   27            57000          0
4       1   19            76000          0

In [19]:
data.tail()

     Gender  Age  EstimatedSalary  Purchased
395       0   46            41000          1
396       1   51            23000          1
397       0   50            20000          1
398       1   36            33000          0
399       0   49            36000          1

__Now we can split the data into training and test data__

In [20]:
X = data.drop(['Purchased'], axis =1)
y = data['Purchased']

In [21]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state = 0, test_size = 0.3)

In [22]:
X_train.head()

     Gender  Age  EstimatedSalary
92        1   26            15000
223       1   60           102000
234       0   38           112000
232       1   40           107000
377       0   42            53000

In [27]:
classifier = DecisionTreeClassifier()

In [28]:
classifier = classifier.fit(X_train, y_train)

In [29]:
y_pred = classifier.predict(X_test)

In [32]:
Score = metrics.accuracy_score(y_test, y_pred)

In [34]:
print(Score)

0.8833333333333333

In [35]:
metrics.confusion_matrix(y_test, y_pred)

array([[71,  8],
       [ 6, 35]], dtype=int64)